node {
  name: "epoch/initial_value"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "epoch"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "epoch/Assign"
  op: "Assign"
  input: "epoch"
  input: "epoch/initial_value"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@epoch"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "epoch/read"
  op: "Identity"
  input: "epoch"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@epoch"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "s0"
  op: "Placeholder"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 70
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 70
        }
      }
    }
  }
}
node {
  name: "s1"
  op: "Placeholder"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 70
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 70
        }
      }
    }
  }
}
node {
  name: "Actor_is_training"
  op: "Placeholder"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "action"
  op: "Placeholder"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "actor/fc1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "F\000\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "actor/fc1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1356646865606308
      }
    }
  }
}
node {
  name: "actor/fc1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1356646865606308
      }
    }
  }
}
node {
  name: "actor/fc1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor/fc1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 70
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 1234
    }
  }
  attr {
    key: "seed2"
    value {
      i: 15
    }
  }
}
node {
  name: "actor/fc1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "actor/fc1/kernel/Initializer/random_uniform/max"
  input: "actor/fc1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "actor/fc1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "actor/fc1/kernel/Initializer/random_uniform/RandomUniform"
  input: "actor/fc1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 70
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/fc1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "actor/fc1/kernel/Initializer/random_uniform/mul"
  input: "actor/fc1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 70
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/fc1/kernel"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 70
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 70
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "actor/fc1/kernel/Assign"
  op: "Assign"
  input: "actor/fc1/kernel"
  input: "actor/fc1/kernel/Initializer/random_uniform"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 70
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "actor/fc1/kernel/read"
  op: "Identity"
  input: "actor/fc1/kernel"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/kernel"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 70
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/fc1/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor/fc1/bias"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "actor/fc1/bias/Assign"
  op: "Assign"
  input: "actor/fc1/bias"
  input: "actor/fc1/bias/Initializer/zeros"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "actor/fc1/bias/read"
  op: "Identity"
  input: "actor/fc1/bias"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/fc1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/fc1/MatMul"
  op: "MatMul"
  input: "s0"
  input: "actor/fc1/kernel/read"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "actor/fc1/BiasAdd"
  op: "BiasAdd"
  input: "actor/fc1/MatMul"
  input: "actor/fc1/bias/read"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "actor/batch_normalization/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor/batch_normalization/beta"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "actor/batch_normalization/beta/Assign"
  op: "Assign"
  input: "actor/batch_normalization/beta"
  input: "actor/batch_normalization/beta/Initializer/zeros"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "actor/batch_normalization/beta/read"
  op: "Identity"
  input: "actor/batch_normalization/beta"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moving_mean"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "actor/batch_normalization/moving_mean/Assign"
  op: "Assign"
  input: "actor/batch_normalization/moving_mean"
  input: "actor/batch_normalization/moving_mean/Initializer/zeros"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "actor/batch_normalization/moving_mean/read"
  op: "Identity"
  input: "actor/batch_normalization/moving_mean"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moving_variance"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "actor/batch_normalization/moving_variance/Assign"
  op: "Assign"
  input: "actor/batch_normalization/moving_variance"
  input: "actor/batch_normalization/moving_variance/Initializer/ones"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "actor/batch_normalization/moving_variance/read"
  op: "Identity"
  input: "actor/batch_normalization/moving_variance"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moments/mean/reduction_indices"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moments/mean"
  op: "Mean"
  input: "actor/fc1/BiasAdd"
  input: "actor/batch_normalization/moments/mean/reduction_indices"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "actor/batch_normalization/moments/StopGradient"
  op: "StopGradient"
  input: "actor/batch_normalization/moments/mean"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moments/SquaredDifference"
  op: "SquaredDifference"
  input: "actor/fc1/BiasAdd"
  input: "actor/batch_normalization/moments/StopGradient"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moments/variance/reduction_indices"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moments/variance"
  op: "Mean"
  input: "actor/batch_normalization/moments/SquaredDifference"
  input: "actor/batch_normalization/moments/variance/reduction_indices"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "actor/batch_normalization/moments/Squeeze"
  op: "Squeeze"
  input: "actor/batch_normalization/moments/mean"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "actor/batch_normalization/moments/Squeeze_1"
  op: "Squeeze"
  input: "actor/batch_normalization/moments/variance"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond/Switch"
  op: "Switch"
  input: "Actor_is_training"
  input: "Actor_is_training"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond/switch_t"
  op: "Identity"
  input: "actor/batch_normalization/cond/Switch:1"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond/switch_f"
  op: "Identity"
  input: "actor/batch_normalization/cond/Switch"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond/pred_id"
  op: "Identity"
  input: "Actor_is_training"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond/Switch_1"
  op: "Switch"
  input: "actor/batch_normalization/moments/Squeeze"
  input: "actor/batch_normalization/cond/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moments/Squeeze"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond/Switch_2"
  op: "Switch"
  input: "actor/batch_normalization/moving_mean/read"
  input: "actor/batch_normalization/cond/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond/Merge"
  op: "Merge"
  input: "actor/batch_normalization/cond/Switch_2"
  input: "actor/batch_normalization/cond/Switch_1:1"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_1/Switch"
  op: "Switch"
  input: "Actor_is_training"
  input: "Actor_is_training"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_1/switch_t"
  op: "Identity"
  input: "actor/batch_normalization/cond_1/Switch:1"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_1/switch_f"
  op: "Identity"
  input: "actor/batch_normalization/cond_1/Switch"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_1/pred_id"
  op: "Identity"
  input: "Actor_is_training"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_1/Switch_1"
  op: "Switch"
  input: "actor/batch_normalization/moments/Squeeze_1"
  input: "actor/batch_normalization/cond_1/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moments/Squeeze_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_1/Switch_2"
  op: "Switch"
  input: "actor/batch_normalization/moving_variance/read"
  input: "actor/batch_normalization/cond_1/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_1/Merge"
  op: "Merge"
  input: "actor/batch_normalization/cond_1/Switch_2"
  input: "actor/batch_normalization/cond_1/Switch_1:1"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/Switch"
  op: "Switch"
  input: "Actor_is_training"
  input: "Actor_is_training"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/switch_t"
  op: "Identity"
  input: "actor/batch_normalization/cond_2/Switch:1"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/switch_f"
  op: "Identity"
  input: "actor/batch_normalization/cond_2/Switch"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/pred_id"
  op: "Identity"
  input: "Actor_is_training"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/AssignMovingAvg/decay"
  op: "Const"
  input: "^actor/batch_normalization/cond_2/switch_t"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/AssignMovingAvg/sub"
  op: "Sub"
  input: "actor/batch_normalization/cond_2/AssignMovingAvg/sub/Switch:1"
  input: "actor/batch_normalization/cond_2/AssignMovingAvg/sub/Switch_1:1"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "actor/batch_normalization/moving_mean/read"
  input: "actor/batch_normalization/cond_2/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "actor/batch_normalization/cond/Merge"
  input: "actor/batch_normalization/cond_2/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/cond/Merge"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/AssignMovingAvg/mul"
  op: "Mul"
  input: "actor/batch_normalization/cond_2/AssignMovingAvg/sub"
  input: "actor/batch_normalization/cond_2/AssignMovingAvg/decay"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/AssignMovingAvg"
  op: "AssignSub"
  input: "actor/batch_normalization/cond_2/AssignMovingAvg/Switch:1"
  input: "actor/batch_normalization/cond_2/AssignMovingAvg/mul"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "actor/batch_normalization/moving_mean"
  input: "actor/batch_normalization/cond_2/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/Switch_1"
  op: "Switch"
  input: "actor/batch_normalization/moving_mean/read"
  input: "actor/batch_normalization/cond_2/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_2/Merge"
  op: "Merge"
  input: "actor/batch_normalization/cond_2/Switch_1"
  input: "actor/batch_normalization/cond_2/AssignMovingAvg"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/Switch"
  op: "Switch"
  input: "Actor_is_training"
  input: "Actor_is_training"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/switch_t"
  op: "Identity"
  input: "actor/batch_normalization/cond_3/Switch:1"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/switch_f"
  op: "Identity"
  input: "actor/batch_normalization/cond_3/Switch"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/pred_id"
  op: "Identity"
  input: "Actor_is_training"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/AssignMovingAvg/decay"
  op: "Const"
  input: "^actor/batch_normalization/cond_3/switch_t"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/AssignMovingAvg/sub"
  op: "Sub"
  input: "actor/batch_normalization/cond_3/AssignMovingAvg/sub/Switch:1"
  input: "actor/batch_normalization/cond_3/AssignMovingAvg/sub/Switch_1:1"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "actor/batch_normalization/moving_variance/read"
  input: "actor/batch_normalization/cond_3/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "actor/batch_normalization/cond_1/Merge"
  input: "actor/batch_normalization/cond_3/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/cond_1/Merge"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/AssignMovingAvg/mul"
  op: "Mul"
  input: "actor/batch_normalization/cond_3/AssignMovingAvg/sub"
  input: "actor/batch_normalization/cond_3/AssignMovingAvg/decay"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/AssignMovingAvg"
  op: "AssignSub"
  input: "actor/batch_normalization/cond_3/AssignMovingAvg/Switch:1"
  input: "actor/batch_normalization/cond_3/AssignMovingAvg/mul"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "actor/batch_normalization/moving_variance"
  input: "actor/batch_normalization/cond_3/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/Switch_1"
  op: "Switch"
  input: "actor/batch_normalization/moving_variance/read"
  input: "actor/batch_normalization/cond_3/pred_id"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/cond_3/Merge"
  op: "Merge"
  input: "actor/batch_normalization/cond_3/Switch_1"
  input: "actor/batch_normalization/cond_3/AssignMovingAvg"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/batchnorm/add/y"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "actor/batch_normalization/batchnorm/add"
  op: "Add"
  input: "actor/batch_normalization/cond_1/Merge"
  input: "actor/batch_normalization/batchnorm/add/y"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "actor/batch_normalization/batchnorm/add"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "actor/batch_normalization/batchnorm/mul"
  op: "Mul"
  input: "actor/fc1/BiasAdd"
  input: "actor/batch_normalization/batchnorm/Rsqrt"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
